<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","label":"tts-10x-atj-dev","backend":"715ba240e7568629efe260d10ae9ce11ff218cd6d7d16680ce04f188e7a87842","plan_job_ref":"Job Post Terraform plan to PR comment #244 at https://github.com/GSA-TTS/atj-platform/actions/runs/10520640191","plan_out_hash":"ddc7840f04c43f910b82b7f7b73531e3e0008818d2f5b9d2922e7de817920048","plan_hash":"49085faae3230b3d0cbbffb04eee88768f5f72d6f2f79886c104813c9d7273e6","plan_text_format":"diff","version":"1.44.0"} -->
Terraform plan for __tts-10x-atj-dev__
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # cloudfoundry_app.tts-10x-atj-dev-server-doj_tts-10x-atj-dev-server-doj-app_380DB029 will be created
+   resource "cloudfoundry_app" "tts-10x-atj-dev-server-doj_tts-10x-atj-dev-server-doj-app_380DB029" {
+       buildpack                       = (known after apply)
+       disk_quota                      = 4096
+       docker_image                    = "ghcr.io/gsa-tts/atj-platform/server-doj:a3a5b478d29faea800ff64c850388c2134729e34"
+       enable_ssh                      = (known after apply)
+       environment                     = (sensitive value)
+       health_check_http_endpoint      = "/"
+       health_check_invocation_timeout = (known after apply)
+       health_check_timeout            = (known after apply)
+       health_check_type               = "http"
+       id                              = (known after apply)
+       id_bg                           = (known after apply)
+       instances                       = 1
+       memory                          = 1024
+       name                            = "tts-10x-atj-dev-server-doj-app"
+       ports                           = (known after apply)
+       space                           = "97f871cd-ea2a-4728-a556-aa7d34204f75"
+       stack                           = (known after apply)
+       stopped                         = false
+       strategy                        = "none"
+       timeout                         = 60

+       routes {
+           port  = (known after apply)
+           route = "6e003acf-4bc4-497b-9116-10a28dcdf37e"
        }

+       service_binding {
+           service_instance = "5ca5c49e-9609-4271-8d88-6c7d57ae5612"
        }
+       service_binding {
+           service_instance = "b4cba13d-f667-40eb-95e1-308eec6a5673"
        }
    }

  # cloudfoundry_app.tts-10x-atj-dev-server-kansas_tts-10x-atj-dev-server-kansas-app_337A9CF1 will be created
+   resource "cloudfoundry_app" "tts-10x-atj-dev-server-kansas_tts-10x-atj-dev-server-kansas-app_337A9CF1" {
+       buildpack                       = (known after apply)
+       disk_quota                      = 4096
+       docker_image                    = "ghcr.io/gsa-tts/atj-platform/server-kansas:a3a5b478d29faea800ff64c850388c2134729e34"
+       enable_ssh                      = (known after apply)
+       environment                     = (sensitive value)
+       health_check_http_endpoint      = "/"
+       health_check_invocation_timeout = (known after apply)
+       health_check_timeout            = (known after apply)
+       health_check_type               = "http"
+       id                              = (known after apply)
+       id_bg                           = (known after apply)
+       instances                       = 1
+       memory                          = 1024
+       name                            = "tts-10x-atj-dev-server-kansas-app"
+       ports                           = (known after apply)
+       space                           = "97f871cd-ea2a-4728-a556-aa7d34204f75"
+       stack                           = (known after apply)
+       stopped                         = false
+       strategy                        = "none"
+       timeout                         = 60

+       routes {
+           port  = (known after apply)
+           route = "fa9cb908-8382-4a28-97d4-c298ebebdb6f"
        }

+       service_binding {
+           service_instance = "0e47e45a-6ecf-4d5e-8e45-1a8c754a555f"
        }
+       service_binding {
+           service_instance = "83d706dc-757e-41da-bba8-505095c55bd0"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Post Terraform plan to PR comment #244](https://github.com/GSA-TTS/atj-platform/actions/runs/10520640191)